ayudha_letter = ['ஃ']
special_chars=[u'.',u';',u',',u':',u'?']
one_letter_words=[u'கை',u'தீ',u'தை',u'பூ',u'மை']
suttu_vina=[u'அ',u'ஆ',u'இ',u'ஈ',u'எ',u'யா']
numerals=[u'ஒன்று',u'இரண்டு',u'மூன்று',u'நான்கு',u'ஐந்து',u'ஆறு',u'நூறு',u'ஏழு',u'ஒன்பது',u'ஒரு',u'இரு',u'அறு',u'எழு']
viyankol=[u'கற்க',u'நில்',u'கவனி',u'செல்',u'செல்க',u'மன்னிய',u'வெல்க',u'செப்பும்',u'வினாவும்',u'வாழ்க',u'ஓம்பல்',u'அஞ்சாமை',u'வாழி',u'வீழ்க',u'ஒழிக',u'வருக',u'உண்க',u'அருள்க',u'கருணைபுரிக',u'வருக',u'வாழிய',
            u'வாழியர்',u'வாரற்க',u'கூறற்க',u'செல்லற்க',u'வாரல்',u'செல்லல்',u'பகரேல்']


special_chars=[u'.',u'\'',u';',u',',u':',u'?',u'(',u')',u'_',u'-',u'"',u'%',u'±',u'#',u'@',u'!',u'!',u'$',u'%',u'^',u'&',u'*',u'+',u'/',u'–',u'\\',u'>',u'<',u'|',u'}',u'{',u']',u'[']
one_letter_words=[u'கை',u'த',u'தை',u'பூ',u'மை']
numbers=[u'0',u'1',u'2',u'3',u'4',u'5',u'6',u'7',u'8',u'9',u'½']
granda = [u"ஜ்",u"ஷ்", u"ஸ்",u"ஹ்"
,u"ஶ", 	u"ஶா", 	u"ஶி", 	u"ஶீ", u"ஶு", u"ஶூ", u"ஶெ", u"ஶே", u"ஶை", u"ஶொ", u"ஶோ", u"ஶௌ"
,u"ஜ"  ,u"ஜா"  ,u"ஜி"  ,u"ஜீ"  ,u"ஜு"  ,u"ஜூ"  ,u"ஜெ"  ,u"ஜே"  ,u"ஜை"  ,u"ஜொ"  ,u"ஜோ"  ,u"ஜௌ"
,u"ஷ"  ,u"ஷா"  ,u"ஷி"  ,u"ஷீ"  ,u"ஷு"  ,u"ஷூ"  ,u"ஷெ"  ,u"ஷே"  ,u"ஷை"  ,u"ஷொ"  ,u"ஷோ"  ,u"ஷௌ"
,u"ஸ"  ,u"ஸா"  ,u"ஸி"  ,u"ஸீ"  ,u"ஸு"  ,u"ஸூ"  ,u"ஸெ"  ,u"ஸே"  ,u"ஸை"  ,u"ஸொ"  ,u"ஸோ"  ,u"ஸௌ"
,u"ஹ"  ,u"ஹா"  ,u"ஹி"  ,u"ஹீ"  ,u"ஹு"  ,u"ஹூ"  ,u"ஹெ"  ,u"ஹே"  ,u"ஹை"  ,u"ஹொ"  ,u"ஹோ"  ,u"ஹௌ"
,u"க்ஷ" ,u"க்ஷா" ,u"க்ஷி" ,u"க்ஷீ" ,u"க்ஷு" ,u"க்ஷூ" ,u"க்ஷெ" ,u"க்ஷே" ,u"க்ஷை" ,u"க்ஷொ" ,u"க்ஷோ" ,u"க்ஷௌ" ]
english = ['a','b','c','d','e','f','g','h','i','j','k','l','m','n','o','p','q','r','s','t','u','v','w','x','y','z','A','B','C','D','E','F','G','H','I','J','K','L','M','N','O','P','Q','R','S','T','U','V','W','X','Y','Z']


suttu_vina_not=[u'அ',u'இ',u'எ',u'யா',u'அந்த',u'இந்த',u'எந்த',u'அங்கு',u'இங்கு',u'எங்கு',u'ஆங்கு',u'ஈங்கு',u'யாங்கு',u'அப்படி',u'இப்படி',u'எப்படி',u'ஆண்டு',u'ஈண்டு',u'யாண்டு',u'அவ்வகை',u'இவ்வகை',u'எவ்வகை',u'அத்துணை',u'இத்துணை']
specific_words=[u'அது',u'இது',u'எது',u'யாது',u'அவை',u'இவை',u'எவை',u'அன்று',u'இன்று',u'என்று',u'அத்தனை',u'இத்தனை',u'எத்தனை',u'அவ்வளவு',u'இவ்வளவு',u'எவ்வளவு',u'அவ்வாறு',u'இவ்வாறு',u'எவ்வாறு',u'ஒன்று',u'இரண்டு',u'மூன்று',u'நான்கு',u'ஐந்து',u'ஆறு',u'நூறு',u'ஏழு',u'ஒன்பது',u'ஒரு',u'இரு',u'அறு',u'எழு',u'கற்க',u'நில்',u'கவனி',u'செல்',u'செல்க',u'மன்னிய',u'வெல்க',u'செப்பும்',u'வினாவும்',u'வாழ்க',u'ஓம்பல்',u'அஞ்சாமை',u'வாழி',u'வீழ்க',u'ஒழிக',u'வருக',u'உண்க',u'அருள்க',u'கருணைபுரிக',u'வருக',u'வாழிய',u'வாழியர்',u'வாரற்க',u'கூறற்க',u'செல்லற்க',u'வாரல்',u'செல்லல்',u'பகரேல்',u'கல', 'பல',u'சில',u'வா',u'எழு',u'போ',u'பார்']

uyirmei_letters=["க","கா","கி","கீ","கு","கூ","கெ","கே","கை","கொ","கோ","கௌ","ச","சா","சி","சீ","சு","சூ","செ","சே","சை","சொ","சோ","சௌ","ட","டா","டி","டீ","டு","டூ","டெ","டே","டை","டொ","டோ","டௌ","த","தா","தி","தீ","து","தூ","தெ","தே","தை","தொ","தோ","தௌ","ப","பா","பி","பீ","பு","பூ","பெ","பே","பை","பொ","போ","பௌ","ற","றா","றி","றீ","று","றூ","றெ","றே","றை","றொ","றோ","றௌ","ஞ","ஞா","ஞி","ஞீ","ஞு","ஞூ","ஞெ","ஞே","ஞை","ஞொ","ஞோ","ஞௌ","ங","ஙா","ஙி","ஙீ","ஙு","ஙூ","ஙெ","ஙே","ஙை","ஙொ","ஙோ","ஙௌ","ண","ணா","ணி","ணீ","ணு","ணூ","ணெ","ணே","ணை","ணொ","ணோ","ணௌ","ந","நா","நி","நீ","நு","நூ","நெ","நே","நை","நொ","நோ","நௌ","ம","மா","மி","மீ","மு","மூ","மெ","மே","மை","மொ","மோ","மௌ","ன","னா","னி","னீ","னு","னூ","னெ","னே","னை","னொ","னோ","னௌ","ய","யா","யி","யீ","யு","யூ","யெ","யே","யை","யொ","யோ","யௌ","ர","ரா","ரி","ரீ","ரு","ரூ","ரெ","ரே","ரை","ரொ","ரோ","ரௌ","ல","லா","லி","லீ","லு","லூ","லெ","லே","லை","லொ","லோ","லௌ","வ","வா","வி","வீ","வு","வூ","வெ","வே","வை","வொ","வோ","வௌ","ழ","ழா","ழி","ழீ","ழு","ழூ","ழெ","ழே","ழை","ழொ","ழோ","ழௌ","ள","ளா","ளி","ளீ","ளு","ளூ","ளெ","ளே","ளை","ளொ","ளோ","ளௌ",]

mei_letters=["க்","ச்","ட்","த்","ப்","ற்","ஞ்","ங்","ண்","ந்","ம்","ன்","ய்","ர்","ல்","வ்","ழ்","ள்",]

accent_symbols = [
    "", "ா", "ி", "ீ", "ு", "ூ", "ெ", "ே", "ை", "ொ", "ோ", "ௌ", "ஃ"
]

tamil_letters=["அ","ஆ","இ","ஈ","உ","ஊ","எ","ஏ","ஐ","ஒ","ஓ","ஔ","ஃ","க்","ச்","ட்","த்","ப்","ற்","ஞ்","ங்","ண்","ந்","ம்","ன்","ய்","ர்","ல்","வ்","ழ்","ள்","ஜ்","ஷ்","ஸ்","ஹ்", "க","கா","கி","கீ","கு","கூ","கெ","கே","கை","கொ","கோ","கௌ","ச","சா","சி","சீ","சு","சூ","செ","சே","சை","சொ","சோ","சௌ","ட","டா","டி","டீ","டு","டூ","டெ","டே","டை","டொ","டோ","டௌ","த","தா","தி","தீ","து","தூ","தெ","தே","தை","தொ","தோ","தௌ","ப","பா","பி","பீ","பு","பூ","பெ","பே","பை","பொ","போ","பௌ","ற","றா","றி","றீ","று","றூ","றெ","றே","றை","றொ","றோ","றௌ","ஞ","ஞா","ஞி","ஞீ","ஞு","ஞூ","ஞெ","ஞே","ஞை","ஞொ","ஞோ","ஞௌ","ங","ஙா","ஙி","ஙீ","ஙு","ஙூ","ஙெ","ஙே","ஙை","ஙொ","ஙோ","ஙௌ","ண","ணா","ணி","ணீ","ணு","ணூ","ணெ","ணே","ணை","ணொ","ணோ","ணௌ","ந","நா","நி","நீ","நு","நூ","நெ","நே","நை","நொ","நோ","நௌ","ம","மா","மி","மீ","மு","மூ","மெ","மே","மை","மொ","மோ","மௌ","ன","னா","னி","னீ","னு","னூ","னெ","னே","னை","னொ","னோ","னௌ","ய","யா","யி","யீ","யு","யூ","யெ","யே","யை","யொ","யோ","யௌ","ர","ரா","ரி","ரீ","ரு","ரூ","ரெ","ரே","ரை","ரொ","ரோ","ரௌ","ல","லா","லி","லீ","லு","லூ","லெ","லே","லை","லொ","லோ","லௌ","வ","வா","வி","வீ","வு","வூ","வெ","வே","வை","வொ","வோ","வௌ","ழ","ழா","ழி","ழீ","ழு","ழூ","ழெ","ழே","ழை","ழொ","ழோ","ழௌ","ள","ளா","ளி","ளீ","ளு","ளூ","ளெ","ளே","ளை","ளொ","ளோ","ளௌ","ஶ","ஶா","ஶி","ஶீ","ஶு","ஶூ","ஶெ","ஶே","ஶை","ஶொ","ஶோ","ஶௌ","ஜ","ஜா","ஜி","ஜீ","ஜு","ஜூ","ஜெ","ஜே","ஜை","ஜொ","ஜோ","ஜௌ","ஷ","ஷா","ஷி","ஷீ","ஷு","ஷூ","ஷெ","ஷே","ஷை","ஷொ","ஷோ","ஷௌ","ஸ","ஸா","ஸி","ஸீ","ஸு","ஸூ","ஸெ","ஸே","ஸை","ஸொ","ஸோ","ஸௌ","ஹ","ஹா","ஹி","ஹீ","ஹு","ஹூ","ஹெ","ஹே","ஹை","ஹொ","ஹோ","ஹௌ","க்ஷ","க்ஷா","க்ஷி","க்ஷீ","க்ஷு","க்ஷூ","க்ஷெ","க்ஷே","க்ஷை","க்ஷொ","க்ஷோ","க்ஷௌ",]

kuril_letters = ["அ", "இ", "உ", "எ", "ஒ"]
nedil_letters = ["ஆ", "ஈ", "ஊ", "ஏ", "ஓ", "ஐ", "ஔ"]
dipthong_letters = ["ஐ", "ஔ"]

pronoun_letters = ["அ", "இ", "உ"]


agaram_letters=["க","ச","ட","த","ப","ற","ஞ","ங","ண","ந","ம","ன","ய","ர","ல","வ","ழ","ள",]
mayangoli_letters = ["ண", "ன", "ந", "ல", "ழ", "ள", "ர", "ற"]